# UpdateExternallyTaggedGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..UpdateExternallyTaggedGeometry Method
DirectShapeType Class See Also
---
Updates the externally tagged geometry object in the DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
```

Visual Basic
---
```text
Public Sub UpdateExternallyTaggedGeometry ( _
	externallyTaggedGeometry As ExternallyTaggedGeometryObject _
)
```

Visual C++
---
```text
public:
void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
```

# ### Parameters
externallyTaggedGeometry
    Type: Autodesk.Revit.DB..::..ExternallyTaggedGeometryObject The externally tagged geometry that should be updated in the DirectShapeType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input shape does not satisfy DirectShapeType validation criteria. -or- A previous version of the externally tagged geometry is not present in this DirectShapeType. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace